
## Plan Result




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_monitor_metric_alert.metric_alert_exceptions[0]
* Update
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_monitor_metric_alert.metric_alert_exceptions[0] will be created
  + resource "azurerm_monitor_metric_alert" "metric_alert_exceptions" {
      + auto_mitigate            = true
      + description              = "Alert will be triggered when Exceptions are more than 2 per 5 mins"
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "exceptions_alert"
      + resource_group_name      = "sptribs-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.Insights/components/sptribs-appinsights-aat",
        ]
      + severity                 = 3
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/sptribs-shared-infrastructure.git"
          + "application"         = "special-tribunals"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#special-tribunals-dev-channel"
          + "environment"         = "staging"
          + "managedBy"           = "Special Tribunals"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.Insights/actionGroups/sptribs-ag1"
        }

      + criteria {
          + aggregation            = "Maximum"
          + metric_name            = "performanceCounters/exceptionsPerSecond"
          + metric_namespace       = "Microsoft.Insights/Components"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 2
        }
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat|sptribs-aat"
        log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        name                       = "sptribs-aat"
        target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat"

        log {
            category = "AuditEvent"
            enabled  = true

            retention_policy {
                days    = 14
                enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"","Vars":{}} -->